CSI API ETABS v1
cCombo.GetTypeOAPI Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeOAPI(
	string name,
	ref int ComboType
)
Function GetTypeOAPI (
	name As String,
	ByRef ComboType As Integer
) As Integer
Dim instance As cCombo
Dim name As String
Dim ComboType As Integer
Dim returnValue As Integer
returnValue = instance.GetTypeOAPI(name,
	ComboType)
int GetTypeOAPI(
	String^ name,
	int% ComboType
)
abstract GetTypeOAPI :
        name : string *
        ComboType : int byref -> int
Parameters
name
Type: System.String
ComboType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cCombo Interface
ETABSv1 Namespace